app/views/likes/show.html.erb

  <% if like.user_id == current_user.id %>
  <!-- <% user = User.find(like.user_id) %> -->
  <% photo = Photo.find(like.photo_id) %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
SELECT  "photos".* FROM "photos" WHERE "photos"."id" = ? LIMIT 1  [["id", 8]]

          <p>
            <% if photo.likes.find_by(:user_id => current_user.id).present? %>
---
SELECT  "likes".* FROM "likes" WHERE "likes"."photo_id" = ? AND "likes"."user_id" = ? LIMIT 1  [["photo_id", 18], ["user_id", 3]]

          <ul class="media-list">
            <% photo.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."photo_id" = ?  [["photo_id", 18]]