app/views/likes/show.html.erb

SELECT "likes".* FROM "likes"
---
  <hr>
  <% @user.likes.each do |like| %>