app/views/users/show.html.erb

SELECT "photos".* FROM "photos" WHERE "photos"."user_id" = ?  [["user_id", 1]]
---

  <% Photo.where(:user_id => @user.id).each do |photo| %>

SELECT  "likes".* FROM "likes" WHERE "likes"."photo_id" = ? AND "likes"."user_id" = ? LIMIT 1  [["photo_id", 1], ["user_id", 1]]
---
  <% if current_user.liked_photos.pluck(:id).include? photo.id %>
      <a href="/delete_like/<%= (Like.find_by(:photo_id => photo.id, :user_id => current_user.id).id) %>" class="btn btn-link">

SELECT "comments".* FROM "comments" WHERE "comments"."photo_id" = ?  [["photo_id", 1]]
---

  <% photo.comments.each do |comment|  %>