app/views/photos/index.html.erb

SELECT  "likes".* FROM "likes" WHERE "likes"."photo_id" = ? AND "likes"."user_id" = ? LIMIT 1  [["photo_id", 15], ["user_id", 2]]
---

                        <% like = Like.find_by(:photo_id => photo.id, :user_id => current_user.id) %>

SELECT "comments".* FROM "comments" WHERE "comments"."photo_id" = ?  [["photo_id", 14]]
---
                      <ul class="media-list">
                        <% photo.comments.each do |comment| %>