app/views/photos/show.html.erb

SELECT  "likes".* FROM "likes" WHERE "likes"."photo_id" = ? AND "likes"."user_id" = ? LIMIT 1  [["photo_id", 8], ["user_id", 2]]
---
        <p>
          <% if @photo.likes.find_by(:user_id => current_user.id).present? %>

SELECT "comments".* FROM "comments" WHERE "comments"."photo_id" = ?  [["photo_id", 8]]
---
        <ul class="media-list">
          <% @photo.comments.each do |comment| %>