app/controllers/comments_controller.rb

  def create
    @comment = Comment.new
    @comment.photo_id = params[:photo_id]
    @comment.body = params[:body]
    @comment.user_id = params[:user_id]

    if @comment.save
---
INSERT INTO "comments" ("photo_id", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["photo_id", 1], ["body", "My first comment"], ["user_id", 1], ["created_at", "2016-05-25 20:37:24.474265"], ["updated_at", "2016-05-25 20:37:24.474265"]]