app/controllers/likes_controller.rb

SELECT "likes".* FROM "likes"
---
  def show
    # @likes = Like.find(current_user.id)
    @likes = Like.all

INSERT INTO "likes" ("user_id", "photo_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["photo_id", 1], ["created_at", "2016-05-25 21:34:03.347265"], ["updated_at", "2016-05-25 21:34:03.347265"]]
---
  def create
    @like = Like.new
    @like.user_id = params[:user_id]
    @like.photo_id = params[:photo_id]

    if @like.save