app/controllers/likes_controller.rb

SELECT  "likes".* FROM "likes" WHERE "likes"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @like = Like.find(params[:id])