app/controllers/photos_controller.rb

  def index
    @photos = Photo.all
    @comment = Comment.new
    @comments = Comment.all
---
SELECT "photos".* FROM "photos"
SELECT "comments".* FROM "comments" WHERE "comments"."photo_id" = ?  [["photo_id", 1]]

  def create
    @photo = Photo.new
    @photo.caption = params[:caption]
    @photo.image = params[:image]
    @photo.user_id = params[:user_id]

    if @photo.save
---
INSERT INTO "photos" ("caption", "image", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)

  def edit
    @photo = Photo.find(params[:id])
---
SELECT  "photos".* FROM "photos" WHERE "photos"."id" = ? LIMIT 1  [["id", 6]]

  def update
    @photo = Photo.find(params[:id])

    @photo.caption = params[:caption]
    @photo.image = params[:image]
    @photo.user_id = params[:user_id]

    if @photo.save
---
SELECT  "photos".* FROM "photos" WHERE "photos"."id" = ? LIMIT 1  [["id", 4]]
UPDATE "photos" SET "caption" = ?, "image" = ?, "updated_at" = ? WHERE "photos"."id" = ?